{
  "questions": [
    {
      "query": {
        "sparql": "SELECT ?x WHERE { ?x <http://www.wikidata.org/prop/direct/P19> <http://www.wikidata.org/entity/Q12439> .  } ", 
        "answers": "{\n  \"head\": {\n    \"vars\": [ \"x\" ]\n  } ,\n  \"results\": {\n    \"bindings\": [\n      \n    ]\n  }\n}\n"
      }, 
      "question": [
        {
          "string": "who is a musician born in detroit", 
          "language": "en"
        }
      ], 
      "id": 0, 
      "knowledgebase": "wikidata"
    }, 
    {
      "query": {
        "sparql": "SELECT ?x WHERE { <http://www.wikidata.org/entity/Q7370831> <http://www.wikidata.org/prop/direct/P162> ?x . } ", 
        "answers": "{\n  \"head\": {\n    \"vars\": [ \"x\" ]\n  } ,\n  \"results\": {\n    \"bindings\": [\n      \n    ]\n  }\n}\n"
      }, 
      "question": [
        {
          "string": "who produced the film rough house rosie", 
          "language": "en"
        }
      ], 
      "id": 1, 
      "knowledgebase": "wikidata"
    }, 
    {
      "query": {
        "sparql": "SELECT ?x WHERE { <http://www.wikidata.org/entity/Q6817891> <http://www.wikidata.org/prop/direct/P364> ?x . } ", 
        "answers": "{\n  \"head\": {\n    \"vars\": [ \"x\" ]\n  } ,\n  \"results\": {\n    \"bindings\": [\n      {\n        \"x\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q1568\" }\n      }\n    ]\n  }\n}\n"
      }, 
      "question": [
        {
          "string": "what is the language in which mera shikar was filmed in", 
          "language": "en"
        }
      ], 
      "id": 2, 
      "knowledgebase": "wikidata"
    }, 
    {
      "query": {
        "sparql": "SELECT ?x WHERE { ?x <http://www.wikidata.org/prop/direct/P276> <http://www.wikidata.org/entity/Q1297> .  } ", 
        "answers": "{\n  \"head\": {\n    \"vars\": [ \"x\" ]\n  } ,\n  \"results\": {\n    \"bindings\": [\n      \n    ]\n  }\n}\n"
      }, 
      "question": [
        {
          "string": "Whats the name of a battle that happened in chicago", 
          "language": "en"
        }
      ], 
      "id": 3, 
      "knowledgebase": "wikidata"
    }, 
    {
      "query": {
        "sparql": "SELECT ?x WHERE { <http://www.wikidata.org/entity/Q6849115> <http://www.wikidata.org/prop/direct/P413> ?x . } ", 
        "answers": "{\n  \"head\": {\n    \"vars\": [ \"x\" ]\n  } ,\n  \"results\": {\n    \"bindings\": [\n      {\n        \"x\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q336286\" }\n      }\n    ]\n  }\n}\n"
      }, 
      "question": [
        {
          "string": "what is the position that  mike twellman plays", 
          "language": "en"
        }
      ], 
      "id": 6, 
      "knowledgebase": "wikidata"
    }, 
    {
      "query": {
        "sparql": "SELECT ?x WHERE { ?x <http://www.wikidata.org/prop/direct/P136> <http://www.wikidata.org/entity/Q842256> .  } ", 
        "answers": "{\n  \"head\": {\n    \"vars\": [ \"x\" ]\n  } ,\n  \"results\": {\n    \"bindings\": [\n      \n    ]\n  }\n}\n"
      }, 
      "question": [
        {
          "string": "list some musical films", 
          "language": "en"
        }
      ], 
      "id": 7, 
      "knowledgebase": "wikidata"
    }, 
    {
      "query": {
        "sparql": "SELECT ?x WHERE { <http://www.wikidata.org/entity/Q7273> <http://www.wikidata.org/prop/direct/P27> ?x . } ", 
        "answers": "{\n  \"head\": {\n    \"vars\": [ \"x\" ]\n  } ,\n  \"results\": {\n    \"bindings\": [\n      {\n        \"x\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q30\" }\n      }\n    ]\n  }\n}\n"
      }, 
      "question": [
        {
          "string": "what is ellen swallow richards's nationality?", 
          "language": "en"
        }
      ], 
      "id": 8, 
      "knowledgebase": "wikidata"
    }, 
    {
      "query": {
        "sparql": "SELECT ?x WHERE { <http://www.wikidata.org/entity/Q4021138> <http://www.wikidata.org/prop/direct/P136> ?x . } ", 
        "answers": "{\n  \"head\": {\n    \"vars\": [ \"x\" ]\n  } ,\n  \"results\": {\n    \"bindings\": [\n      {\n        \"x\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q172980\" }\n      }\n    ]\n  }\n}\n"
      }, 
      "question": [
        {
          "string": "what type a film is wyatt earps revenge", 
          "language": "en"
        }
      ], 
      "id": 11, 
      "knowledgebase": "wikidata"
    }, 
    {
      "query": {
        "sparql": "SELECT ?x WHERE { <http://www.wikidata.org/entity/Q184622> <http://www.wikidata.org/prop/direct/P738> ?x . } ", 
        "answers": "{\n  \"head\": {\n    \"vars\": [ \"x\" ]\n  } ,\n  \"results\": {\n    \"bindings\": [\n      \n    ]\n  }\n}\n"
      }, 
      "question": [
        {
          "string": "who did jean genet influence", 
          "language": "en"
        }
      ], 
      "id": 12, 
      "knowledgebase": "wikidata"
    }
  ]
}